# -*- coding: utf-8 -*-
import collections
import textwrap
import re

text = 'SQL과 파이썬은 전 세계에서 가장 인기 있는 프로그래밍 언어이자 미래에도 수요가 높을 것으로 예상된다. 파이썬과 SQL은 활용 범위가 겹치기만, 보통 SQL은 직접 데이터베이스를 다룰 때 이용하며 파이썬은 보다 범용적으로 프로그래밍에 활용한다. SQL은 데이터에 대한 신속한 분석이 필요하거나 기록을 불러오고 결론을 내릴 때 가장 많이 이용되는 언어이다. SQL도 좋은 언어이지만 R과 파이썬은 복잡한 통계 분석이나 머신러닝, 자동화 기능에 활용할 때, 그 장점이 빛을 발한다. 하지만 최근, 데이터 분야 채용 공고 중 45.4%가 SQL 기술을 요구하여 취업 시장에서 SQL의 수요가 가장 높은 것으로 나타났다. 데이터 사이언스, 데이터 분석, 데이터 엔지니어링, 머신러닝 분야에 취업하고 싶다면, 파이썬과 SQL 능력이 유용할 것이다. 이에, 인도 IT·빅데이터 전문 잡지 애널리틱스 인사이트가 아래와 같이 파이썬과 SQL을 비교했다. SQL은 데이터를 요청하고 추출하기 위하여 설계된 언어이다. 따라서 SQL을 이용하면, 데이터를 불러올 수 있다. 파이썬을 이용한다면, 구조화된 데이터를 수정할 수 있다. SQL은 파이썬보다 코딩이 어렵다. 채용 공고만 보면 SQL은 가장 수요가 높은 프로그래밍 기술로 보인다. 하지만 SQL이 수요가 높은 것은 단순히 기업들이 SQL을 다룰 줄 아는 개발자를 원해서가 아니다. 그들은 보통 다른 프로그래밍 언어에 SQL까지 다룰 수 있는 개발자를 원한다. 파이썬은 애널리틱스 인사이트 자체 조사에서 가장 인기 있는 프로그래밍 언어 1위를 차지했다. SQL은 10위를 기록하였다. 개발자들은 SQL로 데이터베이스를 관리 및 유지하며, 가벼운 분석을 수행하기도 하고 방대한 데이터베이스로부터 기록을 추출하기도 한다. 보통 설문조사에서 자바스크립트가 프로그래밍 언어 인기도 1위를 차지하지만, 이번 조사에서 파이썬이 1위를 차지했다. 개발자는 파이썬으로 회귀 분석을 수행하여 데이터를 분석하고 수정한다. 반면, SQL의 최대 장점은 여러 테이블의 데이터를 통합하여 하나의 데이터베이스를 구성할 수 있다는 점이다. 파이썬이나 R과 같은 범용 언어의 기본을 아는 것은 매우 중요하다. 하지만 SQL을 무시한다면, 데이터 사이언스 분야에 취업할 때 쉽지 않을 것이다. 파이썬을 다룰 수 있지만, SQL 능력이 없다면, 데이터 사이언티스트 취업 기회의 60%를 놓칠 수 있다. SQL은 여전히 데이터를 다루기 위한 인기 있는 언어로 SQL을 배우는 것은 데이터 분야 취업을 위해 필수이다. 계속해서 개발되는 새로운 언어와 프레임워크에 주목하기 쉽다. 그러나 SQL을 한 번 학습해 놓으면 데이터 산업에서 커리어를 쌓는 동안 똑똑히 그 값을 할 것이다.'

# 긴 문장 줄바꿈
text = textwrap.fill(text, width=50)

# 단어 추출
words = re.findall(r'\w+', text)

# 빈도수 산출
counter = collections.Counter(words)

# 상위 빈도수 단어 추출
print(counter.most_common(2))